driver-tests/bpelse/assign/CopyByValue/CopyByValueJbi/test/CopyInSubBP/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <urn:person xmlns:msgns="http://j2ee.netbeans.org/wsdl/childWSDL" xmlns:urn="urn:SampleXSD" name="Original Name">
      <urn:home country="US">
        <urn:name>?string?</urn:name>
        <urn:street>?string?</urn:street>
        <urn:city>?string?</urn:city>
        <urn:state>?string?</urn:state>
        <urn:zip>?1000.00?</urn:zip>
      </urn:home>
      <urn:work country="US">
        <urn:name>?string?</urn:name>
        <urn:street>?string?</urn:street>
        <urn:city>?string?</urn:city>
        <urn:state>?string?</urn:state>
        <urn:zip>?1000.00?</urn:zip>
      </urn:work>
    </urn:person>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
